//TODO: ========================================== Additional Practice 7 ==========================================
// Напишіть функцію wrapInArray, яка приймає значення будь-якого типу і повертає його, обгорнуте в масив. Використовуйте Generics, щоб тип вхідного значення зберігався в типі масиву.

const wrapInArray = <RandomData>(data: RandomData): RandomData[] => {
  return [data];
};

console.log(wrapInArray(5));
//TODO: ========================================== /Additional Practice 7 ==========================================
